package kakao;

/**
 * @author meat
 * 카카오톡에서는 이모티콘을 무제한으로 사용할 수 있는 이모티콘 플러스 서비스 가입자 수를 늘리려고 한다. 이를 위해 이모티콘 행사를 하는데 목표는 다음과 같다.
 * 1. 이모티콘 플러스 서비스 가입자를 최대한 늘리는 것.
 * 2. 이모티콘 판매액을 최대한 늘리는 것.
 * 1번 목표가 우선이며, 2번목표가 그 다음 입니다.
 * 할인행사방식은 다음과 같습니다.
 * n명의 사용자에게 이모티콘 m개를 할인해서 판매
 * 할인율은 이모티콘마다 다를 수 있으며, 10%, 20%, 30%, 40% 중 하나로 결정된다.
 * 사용자들의 구매 규칙
 * 자신의 기준에 따라 일정비율이상 할인시 이모티콘 구매
 * 이모티콘 구매합이 일정가격이상이라면 구매를 취소하고 서비스에 가입한다.
 * 카카오톡 사용자 n명의 구매기준을 담은 2차원 정수배열 users,
 * 이모티콘 m개의 정가를 담은 1차원 정수배열 emoticons
 * 최대한의 목적달성시의 가입수와 매출액을 1차원 정수배열에 담아 return하시오.
 * users(int[][]) 
 * 		[[40, 10000], [25, 10000]]
 * emoticons(int[])
 * 		[7000, 9000]
 * Return
 * 		[1, 5400]
 */
public class x0924_카카오코테_test3 {

}
class Solution3 {
    public int[] solution(int[][] users, int[] emoticons) {
        int[] answer = {};
        return answer;
    }
}