package kakao;

/**
 * @author meat
 *	당신은 이진트리를 수로 표현하는 것을 좋아합니다.
 *	방법은 
 *	1. 이진수를 저장할 빈 문자열을 생성합니다.
 *	2. 주어진 이진트리에 더미 노드를 추가하여 원래 이진트리높이와 같은 높이의 포화 이진트리로 만듭니다.
 * 	3. 만들어진 포화 이진트리의 노드들을 가장 왼쪽 노드부터 가장 오른쪽 노드까지, 왼쪽에 있는 순서대로 살펴봅니다.
 * 	4. 살펴본 노드가 더미노드라면, 문자열 뒤에 0을 추가합니다. 살펴본 노드가 더미 노드가 아니라면 문자열 뒤에 1을 추가합니다.
 *	5. 문자열에 저장된 이진수를 십진수로 변환합니다.
 *
 *이진트리에서 리프노드가 아닌 노드는 자신의 왼쪽자식이 루트인 서브트리의 노드들보다 오른쪽에있으며, 자신의 오른쪽자식이 루트인 서브트리의 노드들보다
 *왼쪽에 있다고 가정합니다.
 * 3-2-4-6으로 이루어진 이진트리를 더미노드를 추가하여 완전이진트리로 만들면 "0111010" 십진수로 58입니다.
 * numbers가 주어지는데, 그 순서대로 이진트리로 해당 수를 표현할 수있다면 1을 없다면 0을 1차원 정수 배열에 담아 return하시오.
 * 
 *
 */
public class x0924_카카오코테_test4 {

}
class Solution4 {
    public int[] solution(long[] numbers) {
        int[] answer = {};
        return answer;
    }
}